app/controllers/walks_controller.rb

SELECT "walks".* FROM "walks"
---
def index
  @walks =Walk.all

INSERT INTO "walks" ("created_at", "end", "interval", "start", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Sat, 30 Nov 2013 19:48:00 UTC +00:00], ["end", "Eiffel Tower"], ["interval", nil], ["start", "Louvre"], ["updated_at", Sat, 30 Nov 2013 19:48:00 UTC +00:00]]
---
def create
  new_walk =Walk.create(params[:walk])

SELECT "walks".* FROM "walks" WHERE "walks"."id" = $1 LIMIT 1  [["id", "1"]]
---
def show
  @walk =Walk.find(params[:id])